# Pandas DataFrame Oluşturma

In [2]:
import pandas as pd

In [3]:
liste = [1,2,3,4324,5235,643,9]

In [4]:
liste

[1, 2, 3, 4324, 5235, 643, 9]

In [5]:
pd.DataFrame(liste, columns = ["değişken ismi"])

   değişken ismi
0              1
1              2
2              3
3           4324
4           5235
5            643
6              9

In [6]:
import numpy as np

In [7]:
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [8]:
pd.DataFrame(m, columns = ["var1", "var2", "var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

## Df İsimlendirme

In [10]:
df = pd.DataFrame(m, columns = ["var1", "var2", "var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [11]:
df.columns = ("deg1", "deg2", "deg3")
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
# ----------------------------

In [13]:
type(df)

pandas.core.frame.DataFrame

In [14]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [15]:
df.shape # Verinin kaç satır ve kaç sütundan oluştuğunu görmek için kullanılır.

(3, 3)

In [16]:
df.ndim # Dizinin veya DataFrame'in kaç boyutlu olduğunu anlamak için kullanılır

2

In [17]:
df.size # Dizinin veya DataFrame'in içerdiği toplam veri noktası sayısını görmek için kullanılır.

9

In [18]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [19]:
type(df.values) # df'den sadece değerleri çekip numpy array nesnesine çevirdi

numpy.ndarray

In [20]:
df.head()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [21]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

### Bir NumPy Array'i Üzerinden bir DataFrame Oluşturma

In [23]:
a = np.array([1,2,34,53])

In [24]:
pd.DataFrame(a, columns = ["değişken"])

   değişken
0         1
1         2
2        34
3        53

# Eleman İşlemleri

In [28]:
import numpy as np

s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [29]:
sozluk = {"var1":s1, "var2":s2, "var3":s3}

In [30]:
sozluk

{'var1': array([8, 0, 5, 5, 5]),
 'var2': array([9, 4, 2, 3, 3]),
 'var3': array([0, 2, 8, 9, 7])}

In [31]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     8     9     0
1     0     4     2
2     5     2     8
3     5     3     9
4     5     3     7

In [32]:
df[0:1]

   var1  var2  var3
0     8     9     0

In [33]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     8     9     0
b     0     4     2
c     5     2     8
d     5     3     9
e     5     3     7

In [35]:
df["c":"e"]

   var1  var2  var3
c     5     2     8
d     5     3     9
e     5     3     7

### Silme İşlemi

In [37]:
df

   var1  var2  var3
a     8     9     0
b     0     4     2
c     5     2     8
d     5     3     9
e     5     3     7

In [38]:
df.drop("a", axis = 0)

   var1  var2  var3
b     0     4     2
c     5     2     8
d     5     3     9
e     5     3     7

In [39]:
df

   var1  var2  var3
a     8     9     0
b     0     4     2
c     5     2     8
d     5     3     9
e     5     3     7

##### *** silme işlemi kalıcı olmadı ***

In [41]:
df.drop("a", axis = 0, inplace = True)
df

   var1  var2  var3
b     0     4     2
c     5     2     8
d     5     3     9
e     5     3     7

##### *** silme işlemi kalıcı (inplace = True ile) ***

* ***inplace=False***: İndeks sıfırlama işlemi orijinal DataFrame’i etkilemez, yeni bir DataFrame döndürülür.
* ***inplace=True***: İndeks sıfırlama işlemi doğrudan orijinal DataFrame üzerinde yapılır ve geri dönüş olmaz.

#### Birden fazla satırı drop'lamak için fancy kullanabiliriz

In [45]:
silmekİstediklerim = ["c","e"]

In [46]:
df.drop(silmekİstediklerim, axis = 0,  inplace = True)
df

   var1  var2  var3
b     0     4     2
d     5     3     9

### Değişkenler için

##### Değişkenler bazında sorgulama

In [49]:
df

   var1  var2  var3
b     0     4     2
d     5     3     9

In [50]:
"var1" in df

True

In [51]:
m = ["var1", "var2", "var4"]

In [52]:
for i in m:
    print(i in df)

True
True
False

In [53]:
df

   var1  var2  var3
b     0     4     2
d     5     3     9

In [54]:
df["var4"] = df["var1"]/df["var2"]
df

   var1  var2  var3      var4
b     0     4     2  0.000000
d     5     3     9  1.666667

### Değişken Silmek

In [56]:
df.drop("var4", axis = 1, inplace = True)
df

   var1  var2  var3
b     0     4     2
d     5     3     9

### Fancy ile Silmek

In [58]:
silinecek = ["var2","var3"]

In [59]:
df.drop(silinecek, axis = 1)

   var1
b     0
d     5

# Gözlem ve Değişken Seçimi: loc & iloc

In [63]:
import numpy as np
import pandas as pd

x = np.random.randint(1,30, size = (10,3))

df = pd.DataFrame(x, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     6    29     4
1     5     9    20
2    27     4     3
3    16    11    27
4    29    25    27
5     9    19     8
6     7    11     4
7    20    11    16
8    16    16    28
9    25     3    27

In [64]:
# loc: tanımlandığı şekliyle seçim yapmak için kullanılır

In [65]:
df.loc[0:3] # 3 dahil

   var1  var2  var3
0     6    29     4
1     5     9    20
2    27     4     3
3    16    11    27

In [66]:
# iloc: alışık olduğumuz indeksleme mantığıyla seçim yapar

In [67]:
df.iloc[0:3] # 3 dahil değil

   var1  var2  var3
0     6    29     4
1     5     9    20
2    27     4     3

In [68]:
df.iloc[0,0]

6

In [69]:
df.iloc[:3,:2]

   var1  var2
0     6    29
1     5     9
2    27     4

In [70]:
df.loc[0:3, "var3"]

0     4
1    20
2     3
3    27
Name: var3, dtype: int32

In [71]:
df.iloc[0:3]["var3"] # değişken seçmek için bu şekilde

0     4
1    20
2     3
Name: var3, dtype: int32

* **loc**, veri seçiminde satır ve sütun etiketlerine (isimlerine) dayalıdır. Yani, indeks isimleri veya sütun adlarını kullanarak veri seçebilirsiniz. Hem satır hem de sütun seçiminde loc ile açıkça etiketler belirtilir.

- Kapsamlı aralıklar dahil edilir: Aralık verirken başlangıç ve bitiş etiketleri dahil edilir.

* **iloc**, satır ve sütunları pozisyonlarına (indeks numaralarına) göre seçer. Burada satır ve sütun numaraları (0 tabanlı) kullanılır.

* Kapsamlı aralıklar hariç tutulur: Aralık verirken bitiş numarası hariç tutulur (Python'un dil yapısına uygun).

Kısaca:

loc etiketlere dayanarak seçim yaparken (örneğin, satır indeksi "10" gibi),
iloc ise her zaman satır ve sütun numaralarına dayanarak seçim yapar (örneğin, ilk satır veya ilk sütun gibi).

# Koşullu Eleman İşlemleri

In [78]:
import numpy as np
import pandas as pd

y = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(y, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    23     4    20
1    19     8    27
2    28     3     6
3    29     4    17
4     9    23    26
5    23     8    25
6     7    15    23
7     2    18    17
8     2     2     1
9     1    13    21

In [79]:
df["var2"]

0     4
1     8
2     3
3     4
4    23
5     8
6    15
7    18
8     2
9    13
Name: var2, dtype: int32

In [80]:
df["var2"][0:2]

0    4
1    8
Name: var2, dtype: int32

In [81]:
df[0:2]

   var1  var2  var3
0    23     4    20
1    19     8    27

In [82]:
df[0:2]["var1"]

0    23
1    19
Name: var1, dtype: int32

In [83]:
# --> df[0:2]["var1","var2"] # ÇALIŞMAZ

# fancy yardımı ile yapabiliriz
df[0:2][["var1","var2"]]

   var1  var2
0    23     4
1    19     8

In [148]:
df

   var1  var2  var3
0    23     4    20
1    19     8    27
2    28     3     6
3    29     4    17
4     9    23    26
5    23     8    25
6     7    15    23
7     2    18    17
8     2     2     1
9     1    13    21

In [150]:
df.var1

0    23
1    19
2    28
3    29
4     9
5    23
6     7
7     2
8     2
9     1
Name: var1, dtype: int32

In [152]:
df[df.var1 > 15] # var1 15'ten büyükse gösterir

   var1  var2  var3
0    23     4    20
1    19     8    27
2    28     3     6
3    29     4    17
5    23     8    25

In [154]:
df[df.var1 > 15]["var2"] # bu koşulu sağlayanların var2'sini gösterir

0    4
1    8
2    3
3    4
5    8
Name: var2, dtype: int32

In [158]:
df[(df.var1 > 15) & (df.var3 < 9)] # birden fazla koşul belirttik

   var1  var2  var3
2    28     3     6

In [185]:
# df[(df.var1 > 15), ["var1","var2"]] HATA VERİR

# df[(df.var1 > 15), ["var1","var2"]] ifadesi hata verir çünkü Pandas'da bu tür filtreleme ve sütun seçimi yaparken loc veya iloc gibi veri seçme metodlarını kullanmak gereklidir. 
# Bu durumda, loc kullanılmalıdır.

In [187]:
df[(df.var1 > 15)] [["var1","var2"]]

   var1  var2
0    23     4
1    19     8
2    28     3
3    29     4
5    23     8

In [189]:
df.loc[(df.var1 > 15), ["var1","var2"]]

   var1  var2
0    23     4
1    19     8
2    28     3
3    29     4
5    23     8

Bu doğru bir kullanım şeklidir çünkü loc fonksiyonu hem satır hem de sütun seçimlerini aynı anda yapmayı sağlar:

loc ile iki işlem yapılabilir:
İlk parametre satır seçimi için (filtreleme) kullanılır.
İkinci parametre ise sütunları belirtmek için kullanılır.

Özetle:
* df.loc[condition, columns]: Satır ve sütunları aynı anda seçmenizi sağlar. İlk parametre satır filtresi, ikinci parametre sütunları belirtir.
* df[condition][columns]: İki aşamalı bir işlem gerçekleştirir. İlk kısımda satırlar filtrelenir, ardından sütunlar seçilir.
* df[condition, columns]: Bu yapı hatalıdır çünkü Pandas böyle bir kullanım desteklemez. Satır ve sütun seçimi loc veya iki adımda yapılmalıdır.



* **Bu yüzden df[(df.var1 > 15), ["var1", "var2"]] hatalıdır, ancak df.loc[...] ve df[...][...] yapıları doğru şekilde çalışır.**

# Birleştirme (Join) İşlemleri

In [232]:
import numpy as np
import pandas as pd
p = np.random.randint(1,30, size = (5,3))
df1 = pd.DataFrame(p, columns = ["var1","var2","var3"])
df1

   var1  var2  var3
0    18    26    10
1     4    28    22
2    27    22    27
3    23    12     2
4    13     5     5

In [234]:
df2 = df1 + 99
df2

   var1  var2  var3
0   117   125   109
1   103   127   121
2   126   121   126
3   122   111   101
4   112   104   104

In [235]:
pd.concat([df1,df2])

   var1  var2  var3
0    18    26    10
1     4    28    22
2    27    22    27
3    23    12     2
4    13     5     5
0   117   125   109
1   103   127   121
2   126   121   126
3   122   111   101
4   112   104   104

In [237]:
?pd.concat

Signature:
pd.concat(
    objs: 'Iterable[Series | DataFrame] | Mapping[HashableT, Series | DataFrame]',
    *,
    axis: 'Axis' = 0,
    join: 'str' = 'outer',
    ignore_index: 'bool' = False,
    keys: 'Iterable[Hashable] | None' = None,
    levels=None,
    names: 'list[HashableT] | None' = None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool | None' = None,
) -> 'DataFrame | Series'
Docstring:
Concatenate pandas objects along a particular axis.

Allows optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis,
which may be useful if the labels are the same (or overlapping) on
the passed axis number.

Parameters
----------
objs : a sequence or mapping of Series or DataFrame objects
    If a mapping is passed, the sorted keys will be used as the `keys`
    argument, unless it is passed, in which case the values will be
    selected (see below). Any None objects will be dropped silently unless
    they are all None in which case a ValueError will be raised.
axis : {0/'index', 1/'columns'}, default 0
    The axis to concatenate along.
join : {'inner', 'outer'}, default 'outer'
    How to handle indexes on other axis (or axes).
ignore_index : bool, default False
    If True, do not use the index values along the concatenation axis. The
    resulting axis will be labeled 0, ..., n - 1. This is useful if you are
    concatenating objects where the concatenation axis does not have
    meaningful indexing information. Note the index values on the other
    axes are still respected in the join.
keys : sequence, default None
    If multiple levels passed, should contain tuples. Construct
    hierarchical index using the passed keys as the outermost level.
levels : list of sequences, default None
    Specific levels (unique values) to use for constructing a
    MultiIndex. Otherwise they will be inferred from the keys.
names : list, default None
    Names for the levels in the resulting hierarchical index.
verify_integrity : bool, default False
    Check whether the new concatenated axis contains duplicates. This can
    be very expensive relative to the actual data concatenation.
sort : bool, default False
    Sort non-concatenation axis if it is not already aligned. One exception to
    this is when the non-concatentation axis is a DatetimeIndex and join='outer'
    and the axis is not already aligned. In that case, the non-concatenation
    axis is always sorted lexicographically.
copy : bool, default True
    If False, do not copy data unnecessarily.

Returns
-------
object, type of objs
    When concatenating all ``Series`` along the index (axis=0), a
    ``Series`` is returned. When ``objs`` contains at least one
    ``DataFrame``, a ``DataFrame`` is returned. When concatenating along
    the columns (axis=1), a ``DataFrame`` is returned.

See Also
--------
DataFrame.join : Join DataFrames using indexes.
DataFrame.merge : Merge DataFrames by indexes or columns.

Notes
-----
The keys, levels, and names arguments are all optional.

A walkthrough of how this method fits in with other tools for combining
pandas objects can be found `here
<https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html>`__.

It is not recommended to build DataFrames by adding single rows in a
for loop. Build a list of rows and make a DataFrame in a single concat.

Examples
--------
Combine two ``Series``.

>>> s1 = pd.Series(['a', 'b'])
>>> s2 = pd.Series(['c', 'd'])
>>> pd.concat([s1, s2])
0    a
1    b
0    c
1    d
dtype: object

Clear the existing index and reset it in the result
by setting the ``ignore_index`` option to ``True``.

>>> pd.concat([s1, s2], ignore_index=True)
0    a
1    b
2    c
3    d
dtype: object

Add a hierarchical index at the outermost level of
the data with the ``keys`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'])
s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

Label the index keys you create with the ``names`` option.

>>> pd.concat([s1, s2], keys=['s1', 's2'],
...           names=['Series name', 'Row ID'])
Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

Combine two ``DataFrame`` objects with identical columns.

>>> df1 = pd.DataFrame([['a', 1], ['b', 2]],
...                    columns=['letter', 'number'])
>>> df1
  letter  number
0      a       1
1      b       2
>>> df2 = pd.DataFrame([['c', 3], ['d', 4]],
...                    columns=['letter', 'number'])
>>> df2
  letter  number
0      c       3
1      d       4
>>> pd.concat([df1, df2])
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects with overlapping columns
and return everything. Columns outside the intersection will
be filled with ``NaN`` values.

>>> df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
...                    columns=['letter', 'number', 'animal'])
>>> df3
  letter  number animal
0      c       3    cat
1      d       4    dog
>>> pd.concat([df1, df3], sort=False)
  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

Combine ``DataFrame`` objects with overlapping columns
and return only those that are shared by passing ``inner`` to
the ``join`` keyword argument.

>>> pd.concat([df1, df3], join="inner")
  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

Combine ``DataFrame`` objects horizontally along the x axis by
passing in ``axis=1``.

>>> df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
...                    columns=['animal', 'name'])
>>> pd.concat([df1, df4], axis=1)
  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

Prevent the result from including duplicate index values with the
``verify_integrity`` option.

>>> df5 = pd.DataFrame([1], index=['a'])
>>> df5
   0
a  1
>>> df6 = pd.DataFrame([2], index=['a'])
>>> df6
   0
a  2
>>> pd.concat([df5, df6], verify_integrity=True)
Traceback (most recent call last):
    ...
ValueError: Indexes have overlapping values: ['a']

Append a single row to the end of a ``DataFrame`` object.

>>> df7 = pd.DataFrame({'a': 1, 'b': 2}, index=[0])
>>> df7
    a   b
0   1   2
>>> new_row = pd.Series({'a': 3, 'b': 4})
>>> new_row
a    3
b    4
dtype: int64
>>> pd.concat([df7, new_row.to_frame().T], ignore_index=True)
    a   b
0   1   2
1   3   4
File:      c:\users\tubac\anaconda3\lib\site-packages\pandas\core\reshape\concat.py
Type:      function

In [238]:
pd.concat([df1,df2], ignore_index = True) # ignore_index'yi True'ya çevirince sorun düzeldi

   var1  var2  var3
0    18    26    10
1     4    28    22
2    27    22    27
3    23    12     2
4    13     5     5
5   117   125   109
6   103   127   121
7   126   121   126
8   122   111   101
9   112   104   104

In [239]:
df1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [241]:
df2.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [242]:
df2.columns = ["var1","var2","deg3"]
df2

   var1  var2  deg3
0   117   125   109
1   103   127   121
2   126   121   126
3   122   111   101
4   112   104   104

In [243]:
df1

   var1  var2  var3
0    18    26    10
1     4    28    22
2    27    22    27
3    23    12     2
4    13     5     5

In [244]:
pd.concat([df1,df2])

   var1  var2  var3   deg3
0    18    26  10.0    NaN
1     4    28  22.0    NaN
2    27    22  27.0    NaN
3    23    12   2.0    NaN
4    13     5   5.0    NaN
0   117   125   NaN  109.0
1   103   127   NaN  121.0
2   126   121   NaN  126.0
3   122   111   NaN  101.0
4   112   104   NaN  104.0

In [246]:
pd.concat([df1,df2], join = "inner") # kesişimlere göre birleştirdi

   var1  var2
0    18    26
1     4    28
2    27    22
3    23    12
4    13     5
0   117   125
1   103   127
2   126   121
3   122   111
4   112   104

# İleri Birleştirme İşlemleri

In [262]:
import pandas as pd

### Birebir Birleştirme

In [292]:
df3 = pd.DataFrame({"calisanlar": ["Ali","Veli","Ayse","Fatma"],
                    "grup": ["Muhasebe","Mühendislik","Mühendislik","İK"]})
df3

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [267]:
df4 = pd.DataFrame({"calisanlar": ["Ayse","Ali","Veli","Fatma"],
                    "ilk_giris": [2010, 2009, 2014, 2019]})
df4

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [272]:
pd.merge(df3, df4) # iki DataFrame'i ortak sütunlar üzerinden birleştirir (join yapar).

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse          Tıp       2010
3      Fatma           İK       2019

In [276]:
pd.merge(df3, df4, on = "calisanlar")
# 2 DataFrame'i "calisanlar" adlı ortak sütuna göre birleştirir. 
# Eğer her iki DataFrame'de de "calisanlar" adlı bir sütun varsa, bu sütun üzerinden birleştirme yapılır.

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse          Tıp       2010
3      Fatma           İK       2019

### Çoktan Teke

In [279]:
df5 = pd.merge(df3,df4)
df5

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse          Tıp       2010
3      Fatma           İK       2019

In [283]:
df6 = pd.DataFrame({"grup": ["Muhasebe", "Mühendislik", "İK"],
                    "mudur": ["Caner", "Mustafa", "Berkcan"]})
df6

          grup    mudur
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [285]:
pd.merge(df5, df6)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2      Fatma           İK       2019  Berkcan

### Çoktan Çoka

In [294]:
df7 = pd.DataFrame({"grup": ["Muhasebe", "Muhasebe", "Mühendislik","Mühendislik","İK","İK"],
                    "yetenekler": ["matematik", "excel", "kodlama","linux","excel","yonetim"]})
df7

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yonetim

In [296]:
df3

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3      Fatma           İK

In [298]:
pd.merge(df3, df7)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayse  Mühendislik    kodlama
5       Ayse  Mühendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim